[
  { "_name" : "Introduction to Computers"
   ,"_courseNumber" : "105"
   ,"_subject" : "CSC"
   ,"_preRequisites" : []
   ,"_description" : "Overview of computer applications with emphasis on word processing, spreadsheets, database, presentation tools and internet-based applications."
   ,"_creditHours" : 3
  },
  { "_name" : "Computer Science I"
   ,"_courseNumber" : "150"
   ,"_subject" : "CSC"
   ,"_preRequisites" : []
   ,"_description" : "An introduction to computer programming. Focus on problem solving, algorithm development, design, and programming concepts. Topics include sequence, selection, repetition, functions, and arrays."
   ,"_creditHours" : 3
  },
  { "_name" : "Computer Science II"
   ,"_courseNumber" : "250"
   ,"_subject" : "CSC"
   ,"_preRequisites" : ["CSC 150"]
   ,"_description" : "Problem solving, algorithm design, standards of program style, debugging and testing. Extension of the control structures and data structures of the high-level language introduced in CSC 150. Elementary data structures and basic algorithms that include sorting and searching. Topics include more advanced treatment of functions, data types such as arrays and structures, and files."
   ,"_creditHours" : 3
  },
  { "_name" : "Info Security Fundamentals"
   ,"_courseNumber" : "245"
   ,"_subject" : "CSC"
   ,"_preRequisites" : []
   ,"_description" : "Introductory course in which students explore the principles of information assurance, with emphasis on current threats and vulnerabilities to develop an information security plan to mitigate risk. Information security and assurance issues are explored and a multidisciplinary approach is discussed that examines security policies, models, and mechanisms for confidentiality, integrity, and availability. Theory/Lab."
   ,"_creditHours" : 3
  },
  { "_name" : "Intro to Discrete Math"
   ,"_courseNumber" : "201"
   ,"_subject" : "MATH"
   ,"_preRequisites" : []
   ,"_description" : "An introduction and overview of discrete mathematics. Topics to be selected from other number bases, modular arithmetic, recursion, elementary logic, set theory, matrix operations, linear programming, numerical methods, and discrete probability with computer applications."
   ,"_creditHours" : 3
  },
  { "_name" : "Data Structures"
   ,"_courseNumber" : "300"
   ,"_subject" : "CSC"
   ,"_preRequisites" : ["CSC 250"]
   ,"_description" : "A systematic study of data structures and the accompanying algorithms used in computing problems; structure and use of storage; methods of representing data; techniques for implementing data structures; linear lists; stacks; queue; trees and tree traversal; linked lists; and other structures."
   ,"_creditHours" : 3
  },
  { "_name" : "Assembly Language"
   ,"_courseNumber" : "314"
   ,"_subject" : "CSC"
   ,"_preRequisites" : ["CSC 250"]
   ,"_description" : "A thorough introduction to assembly language programming and processor architecture. A study of low-level programming techniques, and the layout of a typical computer. The student will gain insight into the memory layout, registers run-time stack, and global data segment of a running program."
   ,"_creditHours" : 3
  },
  { "_name" : "Structured Systems Analysis"
   ,"_courseNumber" : "332"
   ,"_subject" : "CIS"
   ,"_preRequisites" : ["CSC 150"]
   ,"_description" : "The study of the Systems Development Life Cycle, including strategies and techniques of structured analysis, planning and design, testing and implementation is stressed.  Case studies will be used along with hands-on application of concepts."
   ,"_creditHours" : 3
  },
  { "_name" : "Discrete Math"
   ,"_courseNumber" : "316"
   ,"_subject" : "CSC"
   ,"_preRequisites" : ["MATH 201"]
   ,"_description" : "Selected topics from Boolean algebra, set theory, logic, functions and relations, difference equations, recurrence relations, application of algorithms, finite graphs, trees, paths and modeling."
   ,"_creditHours" : 3
  },
  { "_name" : "Object Oriented Design"
   ,"_courseNumber" : "260"
   ,"_subject" : "CSC"
   ,"_preRequisites" : ["CSC 250"]
   ,"_description" : "This course emphasizes object-oriented programming methodologies. An object-oriented language will be used to illustrate these OO concepts. The Unified Modeling Language (UML) will be introduced. "
   ,"_creditHours" : 3
  },
  { "_name" : "Database Management Systems"
   ,"_courseNumber" : "484"
   ,"_subject" : "CSC"
   ,"_preRequisites" : ["CSC 150"]
   ,"_description" : "The study of formalized database design. This course will focus on relational model design and the use of SQL. Students will use a modern relational database to implement designs and learn the basics of data management."
   ,"_creditHours" : 3
  },
  { "_name" : "Open Elective I"
   ,"_courseNumber" : "000"
   ,"_subject" : "ANY"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "Networking I"
   ,"_courseNumber" : "383"
   ,"_subject" : "CSC"
   ,"_preRequisites" : []
   ,"_description" : "LAN topologies, media choices, protocols and transmission techniques are addressed. Overview of LAN planning and installation considerations. LAN hardware and software offerings and problem determination procedures are presented."
   ,"_creditHours" : 3
  },
  { "_name" : "Algorithms & Optimization"
   ,"_courseNumber" : "482"
   ,"_subject" : "CSC"
   ,"_preRequisites" : ["CSC 260","CSC 300","MATH 316"]
   ,"_description" : "FALL ONLY. This course will study computer algorithms, their performance, and techniques for optimizing algorithm implementation. A variety of algorithms including search, sorting, and graph algorithms will be examined. Tools and methods for analyzing and measuring both theoretical and practical performance will be studied. Techniques for improving the performance of implementations of the algorithms will be examined. "
   ,"_creditHours" : 3
  },
  { "_name" : "Parallel Computing"
   ,"_courseNumber" : "410"
   ,"_subject" : "CSC"
   ,"_preRequisites" : ["CSC 300"]
   ,"_description" : "FALL ONLY. The fundamental ideas and issues involved in programming and using parallel computers. This course will cover topics in the design, analysis, and implementation of parallel algorithms.  Environments discussed and used may include a variety of shared-memory and message passing models, cluster computing, and GPU computing.  "
   ,"_creditHours" : 3
  },
  { "_name" : "CSC 300+ Level Elective I"
   ,"_courseNumber" : "300"
   ,"_subject" : "CSC"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "Open Elective II"
   ,"_courseNumber" : "000"
   ,"_subject" : "ANY"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "Programming Languages"
   ,"_courseNumber" : "461"
   ,"_subject" : "CSC"
   ,"_preRequisites" : ["CSC 300","CSC 260"]
   ,"_description" : "FALL ONLY. This course consists of two parts. The first part introduces how programming languages are designed, including an introduction to the concepts of parsing and compiling. Issues related to implementation such as type checking, binding, and memory management are discussed. Secondly, the course will survey the spectrum of programming languages paradigms, including traditional imperative, object oriented, functional, and logic languages. <Paste>"
   ,"_creditHours" : 3
  },
  { "_name" : "Software Engineering"
   ,"_courseNumber" : "470"
   ,"_subject" : "CSC"
   ,"_preRequisites" : ["CSC 300"]
   ,"_description" : "FALL ONLY. An introduction to the software engineering process, including lifecycle phases, problem analysis, specification, project estimation and resource estimations, design, implementation, testing/maintenance, and project management. In particular, software validation and verification as well as scheduling and schedule assessment techniques will be discussed. "
   ,"_creditHours" : 3
  },
  { "_name" : "CSC 300+ Elective II"
   ,"_courseNumber" : "300"
   ,"_subject" : "CSC"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "Operating Systems"
   ,"_courseNumber" : "456"
   ,"_subject" : "CSC"
   ,"_preRequisites" : ["CSC 300","CSC 314"]
   ,"_description" : "SPRING ONLY. A study of the functions and structures associated with operating systems with respect to process management, memory management, auxiliary storage management, and processor management. Topics include concurrent and distributed computing, deadlock, real and virtual memory, job and processor scheduling, security and protection."
   ,"_creditHours" : 3
  },
  { "_name" : "Language Processing"
   ,"_courseNumber" : "466"
   ,"_subject" : "CSC"
   ,"_preRequisites" : ["CSC 300","CSC 461"]
   ,"_description" : "SPRING ONLY. A study of computer language processing through the activities of language design, specification, and translation. Computer language processing tools (compiler construction tools) will be used to demonstrate many of the concepts. The scanning, parsing, semantic analysis and code generation phases of compilation will be studied. Theoretical concepts including grammars and automata will be introduced. Programming projects will be required."
   ,"_creditHours" : 3
  },
  { "_name" : "CSC 300+ Elective III"
   ,"_courseNumber" : "300"
   ,"_subject" : "CSC"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "Open Elective III"
   ,"_courseNumber" : "000"
   ,"_subject" : "ANY"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "CSC Elective IV"
   ,"_courseNumber" : "000"
   ,"_subject" : "CSC"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "Written Communication"
   ,"_courseNumber" : "101"
   ,"_subject" : "ENGL"
   ,"_preRequisites" : []
   ,"_description" : "Practice in the skills, research, and documentation needed for the effective academic writing. Analysis of a variety of academic and non-academic texts, rhetorical structures, critical thinking, and audience will be included. "
   ,"_creditHours" : 3
  },
  { "_name" : "Arts and Humanities Elective I"
   ,"_courseNumber" : "000"
   ,"_subject" : "ART"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "Arts and Humanities Elective II"
   ,"_courseNumber" : "000"
   ,"_subject" : "ART"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "Oral Communications"
   ,"_courseNumber" : "101"
   ,"_subject" : "SPCM"
   ,"_preRequisites" : []
   ,"_description" : "Introduces the study of speech fundamentals and critical thinking through frequent public speaking practice, including setting, purpose, audience, and subject."
   ,"_creditHours" : 3
  },
  { "_name" : "Social Science Elective I"
   ,"_courseNumber" : "000"
   ,"_subject" : "SOC"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "Social Science Elective II"
   ,"_courseNumber" : "000"
   ,"_subject" : "SOC"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "Natural Science Elective I"
   ,"_courseNumber" : "000"
   ,"_subject" : "NAT"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "Calculus I"
   ,"_courseNumber" : "123"
   ,"_subject" : "MATH"
   ,"_preRequisites" : []
   ,"_description" : "The study of limits, continuity, derivatives, applications of the derivative, antiderivatives, the definite and indefinite integral, and the fundamental theorem of calculus. "
   ,"_creditHours" : 3
  },
  { "_name" : "Intro to Stats"
   ,"_courseNumber" : "281"
   ,"_subject" : "MATH"
   ,"_preRequisites" : []
   ,"_description" : "A study of descriptive statistics including graphs, measures of central tendency and variability and an introduction to probability theory, sampling and techniques of statistical inference with an emphasis on statistical applications."
   ,"_creditHours" : 3
  },
  { "_name" : "Math Elective I"
   ,"_courseNumber" : "000"
   ,"_subject" : "MATH"
   ,"_preRequisites" : []
   ,"_description" : "Any non-required course >123 from the MATH department"
   ,"_creditHours" : 3
  },
  { "_name" : "Math Elective II"
   ,"_courseNumber" : "000"
   ,"_subject" : "MATH"
   ,"_preRequisites" : []
   ,"_description" : "Any non-required course >123 from the MATH department"
   ,"_creditHours" : 3
  },
  { "_name" : "Natural Science Elective II "
   ,"_courseNumber" : "000"
   ,"_subject" : "NAT"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "College Algebra"
   ,"_courseNumber" : "102"
   ,"_subject" : "MATH"
   ,"_preRequisites" : []
   ,"_description" : ""
   ,"_creditHours" : 3
  },
  { "_name" : "Trigonometry"
   ,"_courseNumber" : "120"
   ,"_subject" : "MATH"
   ,"_preRequisites" : ["MATH 102"]
   ,"_description" : ""
   ,"_creditHours" : 3
  }
]

